{
  "mg astor": {
    "id": "MG Astor",
    "desc": "The MG (Morris Garages) Astor is a contemporary small SUV. It was introduced in 2021 and is renowned for its chic appearance, cutting-edge technologies, and strong safety record. With a bold, dynamic appearance, the front grille and slim LED headlights give the car an impressive appearance. Inside, the Astor boasts an opulent cabin with premium materials, a roomy design, and an array of technological comforts like an expansive entertainment system and an AI-powered personal assistant. With its potent engine and agile handling, the MG Astor is a formidable rival in the market for small SUVs, offering a pleasant and captivating driving experience.",
    "subdesc": "Long Drive Cars is your go-to destination for convenient and budget-friendly car rentals. With our self-drive options, you're in control of your journey from start to finish. Enjoy the freedom and privacy of driving yourself without the hassle of cabs. The Astor offers a comfortable and feature-rich interior, ideal for those extended road trips. And self drive car rentals  with unlimited kilometers and zero deposit, there are no limits to your adventure. Find the closest available self-drive Astor rental car. "
  },
  "renault kwid": {
    "id": "Kwid ",
    "desc": "Renault's Kwid is a small automobile that combines cost with practical design. Its small size allows for easy mobility and agility when navigating through urban environments. The Kwid's unexpectedly roomy interior ensures comfort for the driver and passengers despite its diminutive size. Its sleek exterior design adds a little flair to the streets, and its fuel efficiency makes it an economical option for regular trips. All things considered, the Kwid is more than simply a vehicle; it's a dependable and useful friend for the contemporary city dweller.",

    "subdesc": "With Long Drive Cars' friendly standards and reasonable costs, selecting a self-drive car has never been easier or more economical. Self-drive cars are usually less expensive than taxis with a driver because they don't charge a driver. You also gain greater independence and privacy when someone else doesn't drive your car. The Kwid is a great car for lengthy road journeys because of its roomy interior. With self-drive cars, you have more freedom to go the distance at your own speed because you can drive for an endless amount of kilometers. Find the closest self-drive Kwid car available."
  },

  "maruthi s - presso": {
    "id": "S-Presso",
    "desc": "Maruti Suzuki created the S-Presso, a small urban vehicle distinguished by its SUV-like appearance and small size. It has a strong front grille, plenty of ground clearance, and powerful wheel arches, giving it a tough yet fashionable look. The S-Presso, in spite of its diminutive size, has a roomy cabin with enough head and legroom in addition to contemporary amenities like a touchscreen infotainment system and cutting-edge safety technology. Its fuel-efficient engine provides good fuel economy along with a lively performance that makes it perfect for city driving.",
    "subdesc": "With Long Drive Cars' reasonable rates and customer-friendly policies, renting a car has never been more convenient or economical. Car rentals work out less expensive than hiring a cab with a driver because there is never a driver fee. Additionally, you get to enjoy greater independence and privacy when there isn't a stranger driving your car. The S-Presso's feature-rich interior makes it the perfect car for a road trip. With Long Drive Cars, you have greater freedom to get to your destination at the speed of your choice because you can drive for an unlimited number of kilometers with zero deposit. Find the closest available self-drive S-Presso rental car."
  },

  "hyundai santro": {
    "id": "Hyundai Santro",
    "desc": "The Hyundai Santro is a small, economical, and fuel-efficient car that is renowned for its dependability and affordability. The Santro provides lots of cargo capacity in addition to comfortable passenger seats thanks to its roomy interior and elegant exterior. Modern technology and cutting-edge safety measures make for a seamless and pleasurable driving experience. Families and urban commuters both favor it for its cheap fuel use and minimal maintenance expenses.",
    "subdesc": "A budget friendly method to have a wonderful road trip is to rent a Santro car from Long Drive Cars through self drive Car Rental. You can enjoy privacy and freedom together with financial savings on drivers when you rent a self-drive car. The powerful and rapid pickup of the Santro guarantees a smooth ride whether you're cruising slopes or taking on challenging terrain. Its roomy, airy cabin can accommodate 4 people in comfort, making it ideal for special trips with loved ones or friends that will heighten the excitement and joy of your travels. Find a self drive santro car closest to your location."
  },

  "maruthi celerio": {
    "id": "Celerio",
    "desc": "Compact cars like the Celerio are well-known for their affordability, usefulness, and fuel efficiency. It provides a comfortable driving experience with its roomy interior, plenty of cargo space, and user-friendly amenities. It's a great option for daily use and urban transportation because it has a dependable engine and sophisticated electronics.",
    "subdesc": "Think about hiring a Maruti Celerio from Long Drive Cars. This little hatchback is ideal for travelers looking for a leisurely ride. Compared to hiring a chauffeur-driven cab, self drive car rental from Long Drive Cars is a more cost-effective choice. When you travel without a driver, you'll save money and appreciate the privacy. Furthermore, there is no daily mileage cap with Long Drive Cars, so you can travel as far as you choose. You can travel stress-free with the Celerio because they can even transport it right to your door for extra convenience."
  },

  "maruthi wagon r": {
    "id": "Wagon R",
    "desc": "Popular little cars like the WagonR are prized for their economical price, roomy interior, and excellent fuel economy. Made by Suzuki, its tall-boy style gives it adaptability and makes it perfect for city transportation. The WagonR appeals to cost-conscious customers looking for an affordable, comfortable, yet functional vehicle for everyday usage because of its functional features and dependable performance.",
    "subdesc": "Self Drive Cars Rental offers pocket-friendly costs and consumer-friendly policies that make renting a car even more convenient and economical. Self-drive car rentals work out less expensive than using a chauffeured cab because there is never a driver fee. Additionally, you get to enjoy greater independence and privacy when there isn't a stranger driving your car. The Wagonr's feature-rich interior makes it the perfect car for a road trip. With Long Drive Cars, you have greater freedom to get to your destination at the speed of your choice because you can drive for an unlimited number of kilometers with zero deposit. Find the closest available self-drive Wagonr rental car.  "
  },

  "tata altroz": {
    "id": "Tata Motors' Altroz",
    "desc": "Tata Motors' Altroz is a chic and feature-rich hatchback with a modern aesthetic and cutting-edge technology. Comfort and convenience are provided by its roomy interior, and peace of mind is guaranteed by safety features including twin front airbags and ABS with EBD. It offers a well-balanced combination of performance and fuel efficiency, making it an appealing option in the hatchback market. It is powered by effective gasoline and diesel engines.",
    "subdesc": "Long Drive Cars' affordable pricing and customer-friendly standards make renting a car for self-drive Cars more easy and cost-effective. It's less expensive than using a chauffeured cab because there are no driver expenses and it gives you more privacy and independence. The Altroz's well-equipped interior makes it an excellent choice for road trips. Additionally, you can drive unlimited kilometers with zero deposit when you rent a Long Drive Car, which gives you the freedom to travel at your own speed to your destination.  Find the closest available self-drive Altroz rental car."
  },

  "renault kiger": {
    "id": "Renault's Kiger",
    "desc": "Renault's Kiger is a small SUV that's meant for both off-roading and city exploration. It offers a combination of design and usefulness with its sleek exterior and rough accents. With its roomy cabin, cutting-edge infotainment system, and economical engine choices, the Kiger offers a connected and enjoyable driving experience. Its sturdy construction and clever safety features provide confidence on every surface, giving it a flexible option for contemporary drivers looking for performance and versatility in a small size.",
    "subdesc": "With reasonable rates and customer-friendly policies, Long Drive Cars provides a convenient and cost-effective solution for self-drive automobile rentals. Bid farewell to additional fees for drivers—self-drive rentals provide you greater privacy and independence. The Kiger's roomy and feature-rich cabin is ideal for road trips. You can drive an infinite number of kilometers with Long Drive Cars with zero deposit required, allowing you the freedom to go at your own speed. Find the closest available self-drive Kiger rental car."
  },

  "tata tigor": {
    "id": "Tata Motors Tigor",
    "desc": "Tata Motors offers a little sedan called the Tigor. With distinctive elements like the 'Humanity Line' chrome grille and svelte LED tail lamps, it has an elegant external look. The inside is roomy and equipped with contemporary features like climate control, smartphone connectivity, touchscreen infotainment, and luxury materials. It provides a blend of efficiency and performance under the hood with a choice of gasoline and diesel engines. To ensure a safe driving experience, safety features including twin airbags, ABS with EBD, and rear parking sensors are included. All things considered, the Tata Tigor is a small sedan that blends price, style, and functionality.",
    "subdesc": "With Long Drive Cars, renting a self-drive car is both convenient and affordable. Enjoy pocket-friendly prices and consumer-friendly policies that make it cheaper than hiring a chauffeur-driven cab. Experience the freedom and privacy of driving without an outsider in the car. The Tigor feature-filled interior is perfect for road trips. With Long Drive Cars, you can drive unlimited kilometers with zero deposit, allowing you to reach your destination at your preferred speed. Find the closest available self-drive Tigor  rental car."
  },

  "tata tiago": {
    "id": "Tata Motors Tiago",
    "desc": "An Indian automaker named Tata Motors produces the Tiago, a small hatchback. Since its launch in 2016, it has gained popularity in the category catering to a lower budget by combining cost with a variety of features. With its sleek design, projector headlamps, alloy wheels, and contemporary front grille, it looks great. Comfort features, a touchscreen infotainment system, and plenty of space are available inside. Its fuel-efficient gasoline and diesel engines provide respectable performance, making it the perfect vehicle for city commuting. Rear parking sensors, ABS with EBD, and dual airbags are examples of safety features.",
    "subdesc": "With Long Drive Cars, renting a self-drive car is both convenient and affordable. Enjoy pocket-friendly prices and consumer-friendly policies that make it cheaper than hiring a chauffeur-driven cab. Experience the freedom and privacy of driving without an outsider in the car. The feature-filled interior of the Tiago is perfect for road trips, ensuring a comfortable journey. With Long Drive Cars, you can drive unlimited kilometers with zero deposit, allowing you to reach your destination at your preferred speed. For added convenience, you can even have the car delivered right to your doorstep. Choose Long Drive Cars for your next adventure and enjoy the benefits of self-drive cars."
  },

  "hyundai i10": {
    "id": "Hyundai i10",
    "desc": "The Hyundai i10 is a small city automobile that is renowned for its inexpensive price, fashionable appearance, and effective performance. Along with cutting-edge technologies like smartphone connectivity, touchscreen infotainment, and airbags and ABS safety systems, it has a cozy cabin. Due to its compact size, the i10 offers great maneuverability and fuel efficiency, making it the perfect vehicle for driving in cities. Because of its dependability and inexpensive maintenance, drivers on a tight budget who want efficient, contemporary transportation frequently choose it.",
    "subdesc": "Renting a self-drive car is economical and convenient with Long Drive Cars. Take advantage of affordable rates and customer-friendly policies that make it less expensive than using a chauffeured taxi. Take pleasure in the independence and seclusion that come with driving a car alone. The well-equipped interior of the Hyundai i10 is ideal for road trips. You can go an unlimited number of kilometers with no deposit when you rent a self-drive car, so you can go as fast as you like to get where you're going. Find the closest available self-drive Hyundai i10  rental car."
  },

  "maruthi ignis": {
    "id": "Suzuki Ignis",
    "desc": "The Suzuki Ignis is a small crossover car renowned for its distinctive design and adaptable features. By fusing contemporary style with functionality, it provides a roomy interior, cutting-edge technology, and effective operation. The Ignis is perfect for driving in cities because of its small size and quick handling, but it can also go off-road. Suzuki's Ignis is a well-liked option in its class because of its reputation for dependability and affordability.",
    "subdesc": "Long Drive Cars offers car rentals that are both convenient and affordable. Opting for self-drive cars, you can enjoy pocket-friendly prices and consumer-friendly policies, making it a more economical choice than chauffeur-driven cabs. Experience the freedom and privacy of driving without an outsider. The IGNIS feature-rich interior is ideal for road trips. With Self Drive Cars, drive unlimited kilometers with zero deposit and reach your destination at your own pace. Find the closest available self-drive IGNIS rental car."
  },

  "maruthi alto": {
    "id": " Suzuki Alto",
    "desc": "Popular compact car made by Suzuki, the Alto is renowned for its dependability, affordability, and fuel efficiency. It has been a fixture in the automotive industry for a long time, especially in Asia, where it provides useful urban and suburban transit options. The Alto appeals to buyers on a tight budget who want a durable and convenient vehicle because of its small size and frugal engine.",
    "subdesc": "Long Drive Cars provides convenient and cost-effective car rental solutions. Choose self-drive options for budget-friendly rates and customer-friendly terms, offering more value compared to chauffeur-driven services. Enjoy the freedom and privacy of driving on your own terms. The Alto, with its feature-rich interior, is perfect for extended road trips. Self Drive Cars allow unlimited kilometers with zero deposit, ensuring a stress-free journey at your own pace. Find the closest available self-drive Alto rental car."
  },

  "maruthi k10": {
    "id": " Suzuki K-10",
    "desc": "Maruti Suzuki manufactures the K-10, a small hatchback renowned for its economical price, economical fuel use, and stylish appearance. Its compact form is intended to appeal to urban commuters, making parking and navigating through confined locations simple. With its lively engine, the K-10 offers a nice mix of efficiency and performance. Its small size makes it perfect for driving in cities while giving passengers enough room and comfort.",
    "subdesc": "Long Drive Cars offers affordable and practical car rental options. Select self-drive choices for better value than chauffeur-driven services, with more affordable rates and customer-friendly conditions. Savor the independence and seclusion of driving at your own pace. With its luxurious interior, the K-10 is ideal for long road trips. Self-drive car rentals guarantee a stress-free trip at your own speed by allowing limitless kilometers with zero deposit.  Find the closest available self-drive K-10 rental car."
  },

  "mahindra kuv 100": {
    "id": "Mahindra KUV100",
    "desc": "The Indian automaker Mahindra & Mahindra Limited created and produced the compact SUV known as the Mahindra KUV100. When it was first introduced in 2016, it offered a distinctive blend of tiny car size and SUV style, making it appropriate for driving in cities while still having a rough appeal. Young urban drivers looking for a car that combines elegance and functionality in one package are catered to by the KUV100, thanks to its unique look, roomy cabin, and fuel-efficient engines.",
    "subdesc": "Long Drive Cars provides self-drive solutions that are cost-effective and user-friendly, making their car rentals convenient and reasonably priced. Embrace the independence of driving alone, and bid adieu to pricey chauffeur-driven taxis. The KUV100, equipped with a feature-rich interior, is perfect for long road trips.. Get unlimited kilometers with no deposit when you rent a car from Self Drive Car Rentals. Find the closest available self-drive KUV100 rental car."
  },

  "hyundai eon": {
    "id": "Hyundai Eon",
    "desc": "Hyundai produces the Eon, a small hatchback renowned for its economical pricing, elegant styling, and excellent fuel economy. After its 2011 launch, it became well-known in the subcompact automobile market. It's ideal for driving in cities because of its small size and agile handling. The Eon is a useful option for city commuters because it has a lot of amenities and a spacious cabin despite its compact size.",
    "subdesc": "Long Drive Cars offers affordable and convenient car rentals, providing self-drive options that are both economical and consumer-friendly. Say goodbye to expensive chauffeur-driven cabs and hello to the freedom of driving without an outsider. The Eon, equipped with a feature-rich interior, is perfect for long road trips. With Self Drive Cars, enjoy unlimited kilometers with zero deposit. Find the closest available self-drive Eon rental car."
  },

  "datsun go plus": {
    "id": "Datsun Go Plus",
    "desc": "The Datsun Go Plus is a reasonably priced little hatchback with a practical and efficient combination aimed at urban commuters. It has a 1.2-liter, three-cylinder petrol engine that provides good fuel economy and enough power for city driving. The straightforward yet practical interior has manual air conditioning and a touchscreen infotainment system, among other standard features.",
    "subdesc": "Long Drive Cars provides convenient and cost-effective car rental solutions. Choose self-drive cars options for budget-friendly rates and customer-friendly terms, offering more value compared to chauffeur-driven services. Enjoy the freedom and privacy of driving on your own terms. The Datsun Go, with its feature-rich interior, is perfect for extended road trips. Self Drive Cars Rentals allow unlimited kilometers with zero deposit, ensuring a stress-free journey at your own pace. Find the closest available self-drive Datsun Go rental car."
  },

  "citroen c3": {
    "id": "Citroën C3",
    "desc": "A fashionable and small hatchback, the Citroën C3 is renowned for its distinct style and cutting-edge comfort features. Its rounded body, personalized color choices, and recognizable Airbump® panels give it a unique appearance. With Citroën's Progressive Hydraulic Cushions® for a comfortable ride, a 7-inch touchscreen, and cutting-edge safety systems, the interior is roomy and contemporary. The C3's fuel-efficient engines provide a versatile option for driving in both urban and suburban areas by balancing performance and efficiency.",
    "subdesc": "Experience the convenience and affordability of Long Drive Cars' car rental services. Opt for self-drive car options and enjoy pocket-friendly prices and consumer-friendly policies, making it a more economical choice than traditional chauffeur-driven cabs. Revel in the freedom and privacy of driving without an outsider. The Citroën C3 boasts a feature-rich interior, perfect for extended road trips. With Self Drive Car Rentals, drive unlimited kilometers with zero deposit. Find the closest available self-drive Citroën C3 rental car."
  },

  "hyundai grand i1o": {
    "id": "Grand i10",
    "desc": "The Grand i10  is a small city automobile that is renowned for its inexpensive price, fashionable appearance, and effective performance. Along with cutting-edge technologies like smartphone connectivity, touchscreen infotainment, and airbags and ABS safety systems, it has a cozy cabin. Due to its compact size, the i10 offers great maneuverability and fuel efficiency, making it the perfect vehicle for driving in cities. Because of its dependability and inexpensive maintenance, drivers on a tight budget who want efficient, contemporary transportation frequently choose it.",
    "subdesc": "Renting a self-drive car is economical and convenient with Long Drive Cars. Take advantage of affordable rates and customer-friendly policies that make it less expensive than using a chauffeured taxi. Take pleasure in the independence and seclusion that come with driving a car alone. The well-equipped interior of the Grand i10  is ideal for road trips. You can go an unlimited number of kilometers with zero deposit when you rent a self-drive car, so you can go as fast as you like to get where you're going. Find the closest available self-drive Grand i10  rental car."
  },

  "tata bolt": {
    "id": "Tata's  Bolt",
    "desc": "Tata Motors' flagship vehicle, the Bolt, offers a blend of efficiency and contemporary style with a clean design and strong performance. It has an electric drivetrain with remarkable performance and range, bolstered by cutting-edge technology including regenerative braking and an intelligent infotainment system. For urban commuters seeking sustainability without sacrificing comfort or flair, its roomy cabin, ergonomic design, and eco-friendly credentials make it an appealing option. Tata's dedication to innovation in the electric car industry is best demonstrated by the Bolt.",
    "subdesc": "Long Drive Cars provides convenient and cost-effective car rental solutions. Choose self-drive car options for budget-friendly rates and customer-friendly terms, offering more value compared to chauffeur-driven services. Enjoy the freedom and privacy of driving on your own terms. The Bolt, with its feature-rich interior, is perfect for extended road trips.Self Drive Car Rentals allows unlimited kilometers with zero deposit, ensuring a stress-free journey at your own pace. Find the closest available self-drive Bolt  rental car."
  },

  "ford figo": {
    "id": "Ford Figo",
    "desc": "The Ford Figo is a small hatchback with excellent efficiency and practicality that is suited for city driving. It has a sleek, contemporary appearance with fashionable headlamps and a standout front grille. The Figo's interior features a luxurious cabin with cozy seating and an easy-to-use entertainment system that connects to smartphones. The vehicle's fuel-efficient gasoline and diesel engine options provide a balanced combination of performance and economy. With two airbags, ABS, and a body constructed of high-strength steel, safety is a priority. For city commuters, the Figo is a dependable option because it offers a precise handling experience and a pleasant ride.",
    "subdesc": "Searching for an affordable and practical automobile rental option? Long Drive Cars is here to help! Try one of our self-drive car alternatives instead. We are reasonably priced and have excellent terms that prioritize you. Bid farewell to chauffeurs and welcome independence and seclusion. With its luxurious and well-equipped cabin, the Ford Figo is the ideal vehicle for extended road trips. With our self-drive car rentals, you can travel worry-free because We offer unlimited miles and a zero-deposit policy. Find the closest available self-drive Ford Figo rental car."
  },

  "maruthi dzire": {
    "id": "Swift Dzire",
    "desc": "Maruti Suzuki's well-liked subcompact sedan, the Swift Dzire, blends price, style, and efficiency. Its sleek body, accentuated by a large front grille, attractive headlamps, and polished contour were all part of its futuristic launch design. Comfortable seating, cutting-edge electronics, and safety features like twin airbags and ABS are all featured in the roomy interior. The Dzire's fuel-efficient engine provides excellent mileage together with a comfortable driving experience. Its performance and practicality mix make it a great option for compact families and city commuters, demonstrating Maruti's dedication to excellence and client happiness.",
    "subdesc": "Long Drive Cars provides an economical and practical vehicle rental service. Self-drive car rentals provide better value than chauffeur-driven options, with more affordable pricing and flexible terms to suit your needs. Enjoy the solitude and independence of driving when you choose. With its cabin jam-packed with features, the Swift Dzire is perfect for long road journeys. With zero deposit needed and unlimited kilometers, our self-drive rentals provide a stress-free trip at your own speed. Find the closest available self-drive Swift Dzire rental car."
  },
  "swift dzire": {
    "id": "Swift Dzire",
    "desc": "Maruti Suzuki's well-liked subcompact sedan, the Swift Dzire, blends price, style, and efficiency. Its sleek body, accentuated by a large front grille, attractive headlamps, and polished contour were all part of its futuristic launch design. Comfortable seating, cutting-edge electronics, and safety features like twin airbags and ABS are all featured in the roomy interior. The Dzire's fuel-efficient engine provides excellent mileage together with a comfortable driving experience. Its performance and practicality mix make it a great option for compact families and city commuters, demonstrating Maruti's dedication to excellence and client happiness.",
    "subdesc": "Long Drive Cars provides an economical and practical vehicle rental service. Self-drive car rentals provide better value than chauffeur-driven options, with more affordable pricing and flexible terms to suit your needs. Enjoy the solitude and independence of driving when you choose. With its cabin jam-packed with features, the Swift Dzire is perfect for long road journeys. With zero deposit needed and unlimited kilometers, our self-drive rentals provide a stress-free trip at your own speed. Find the closest available self-drive Swift Dzire rental car."
  },
  "maruthi swift dzire": {
    "id": "Swift Dzire",
    "desc": "Maruti Suzuki's well-liked subcompact sedan, the Swift Dzire, blends price, style, and efficiency. Its sleek body, accentuated by a large front grille, attractive headlamps, and polished contour were all part of its futuristic launch design. Comfortable seating, cutting-edge electronics, and safety features like twin airbags and ABS are all featured in the roomy interior. The Dzire's fuel-efficient engine provides excellent mileage together with a comfortable driving experience. Its performance and practicality mix make it a great option for compact families and city commuters, demonstrating Maruti's dedication to excellence and client happiness.",
    "subdesc": "Long Drive Cars provides an economical and practical vehicle rental service. Self-drive car rentals provide better value than chauffeur-driven options, with more affordable pricing and flexible terms to suit your needs. Enjoy the solitude and independence of driving when you choose. With its cabin jam-packed with features, the Swift Dzire is perfect for long road journeys. With zero deposit needed and unlimited kilometers, our self-drive rentals provide a stress-free trip at your own speed. Find the closest available self-drive Swift Dzire rental car."
  },
  "hyundai exter": {
    "id": "Exter",
    "desc": "The Exter vehicle is the pinnacle of performance and elegance in automotive design. Its modern technology blends flawlessly with its elegant, aerodynamic appearance, which features a potent engine that ignites at the press of a button. Exquisitely crafted, each curve and form radiates sophistication, and the inside provides a luxurious haven with luxurious furnishings and cutting-edge conveniences. With its unparalleled agility on the road, the Exter promises an exciting driving experience that goes beyond standard transportation.",

    "subdesc": "Long Drive Cars provides convenient and cost-effective car rental solutions. Choose self-drive car options for budget-friendly rates and customer-friendly terms, offering more value compared to chauffeur-driven services. Enjoy the freedom and privacy of driving on your own terms. The Exter, with its feature-rich interior, is perfect for extended road trips.Self Drive Car Rentals allows unlimited kilometers with zero deposit, ensuring a stress-free journey at your own pace. Experience the ease of our self-drive cars, with the closest  Exter ready for you."
  },

  "hyundai aura": {
    "id": "Aura",
    "desc": "The Aura vehicle, with its streamlined design that skillfully combines aerodynamics with visual appeal, is the epitome of elegance and creativity. Its cutting-edge engineering provides performance that is unmatched, making for a seamless and thrilling driving experience. The Aura redefines luxury and refinement on the road with its cutting-edge technology interwoven into every part, from its sophisticated infotainment system to its clever safety measures. This car radiates confidence and style whether driving on the highway or through metropolitan areas, raising the bar for automotive perfection.",

    "subdesc": "Long Drive Cars offers a convenient and cost-effective car rental service. Opt for self-drive car rentals to enjoy budget-friendly rates and customer-friendly terms, providing greater value than chauffeur-driven alternatives. Experience the freedom and privacy of driving on your own schedule. The Aura, with its feature-packed interior, is ideal for extended road trips. Our self-drive rentals feature unlimited kilometers with zero deposit required, ensuring a stress-free journey at your own pace. Make your rental process easier with our self-drive cars, especially the nearest Aura."
  },

  "tata punch": {
    "id": "Punch",
    "desc": "The metallic blue Ford Mustang GT packs a powerful punch that turns starting a car from a routine task into an exciting one. The engine roars to life, echoing the spirit of its storied ancestry as the knuckles make contact with the smooth surface with a loud growl. The V8 engine unleashes its full potential and the punch sparks a symphony of power, pushing the car forward with an unstoppable force. Every punch is an assertion of power and a tribute to the unadulterated energy that the legendary Mustang brand embodies.",

    "subdesc": "Long Drive Cars provides convenient and cost-effective car rental solutions. Choose self-drive cars options for budget-friendly rates and customer-friendly terms, offering more value compared to chauffeur-driven services. Enjoy the freedom and privacy of driving on your own terms. The Punch, with its feature-rich interior, is perfect for extended road trips. Self Drive Cars Rentals allow unlimited kilometers with zero deposit, ensuring a stress-free journey at your own pace. Renting is now simpler with our self-drive cars, featuring the closest Punch."
  },

  "honda amaze": {
    "id": "Honda's Amaze",
    "desc": "Honda's Amaze is a small car that embodies style and innovation in the automotive industry. Its modern style deftly combines elegance and functionality, and its roomy interior belies its small exterior. Whether driving on the highway or through cities, the Amaze's state-of-the-art safety features and technologies guarantee a comfortable and safe ride. It offers an exciting driving experience while being environmentally responsible because of its quick handling and fuel-efficient engine options. Redefining standards in the small sedan market, the Amaze is a monument to Honda's dedication to quality and perfection.",

    "subdesc": "Long Drive Cars offers a practical and affordable vehicle rental service. Self-drive car rentals offer more value than chauffeured options, with low rates and customer-focused conditions. Savor the independence and privacy that come with driving on your own schedule. With its spacious cabin, the Grand Nois is a great choice for long road trips. With no deposit required and unlimited kilometers, our self-drive rentals guarantee a hassle-free trip at your own speed. Experience hassle-free rentals with our self-drive cars, offering the nearest  Grand Nois."
  },

  "honda city": {
    "id": "Honda City",
    "desc": "Known for its dependability and efficiency, the Honda City is a shining example in the small sedan market. Its aerodynamic curves and streamlined form combine style and functionality in a seamless way. Its powerful yet fuel-efficient engine provides an exciting driving experience without sacrificing remarkable fuel economy. The inside of the cabin, which is furnished with high-end materials and user-friendly technology, radiates comfort and refinement. The Honda City is the pinnacle of automotive perfection because it provides unmatched comfort, safety, and performance, whether cruising busy city streets or traveling great distances.",

    "subdesc": "Long Drive Cars presents an accessible and cost-effective car rental service. Opt for self-drive car options for pocket-friendly rates and customer-centric conditions, offering superior value compared to chauffeur-driven alternatives. Indulge in the autonomy and privacy of driving at your own convenience. The Honda City, equipped with an array of features, is an ideal companion for extended road trips. With our self-drive rentals, enjoy unlimited kilometers and zero deposit hassle, guaranteeing a stress-free journey at your preferred pace. Make your rental experience effortless with our Self Drive Cars, equipped with the nearest self-drive Honda City."
  },

  "hyundai xcent": {
    "id": "Hyundai's Xcent",
    "desc": "Hyundai's Xcent is a small vehicle that combines elegance and functionality. It provides a comfortable ride for the driver and passengers thanks to its streamlined exterior and elegant interior. It guarantees a convenient and pleasurable driving experience with its modern features, which include rear AC vents, touchscreen infotainment, and plenty of storage areas. Its fuel-efficient engine provides excellent mileage, which makes it perfect for both long trips and city commuting. With equipment like airbags, rear parking sensors, and ABS, safety is of the utmost importance. All things considered, the Hyundai Xcent is a great option for anyone looking for a compact sedan because it blends cost, refinement, and dependability.",

    "subdesc": "Seeking a convenient and economical car rental experience? Look no further than Long Drive Cars. Embrace self-driving rentals for budget-friendly rates and customer-centric policies, outshining chauffeur-driven alternatives. Revel in the independence and solitude of driving on your own terms. The Xcent , featuring a wealth of amenities, is tailor-made for extensive journeys. Our self-drive Car Rentals packages include unlimited kilometers and require zero deposit upfront, ensuring a hassle-free excursion at your own pace. Our Self Drive Cars now offer the convenience of the closest self-drive Xcent  available, making your rental experience effortless."
  },

  "maruthi baleno": {
    "id": "Maruti Suzuki's Baleno",
    "desc": "In the small car market, Maruti Suzuki's Baleno is the pinnacle of style and functionality. Its elegant design, which combines flair and aerodynamics with ease, is highlighted by flowing lines and a dynamic posture. A variety of effective engines, such as the dependable DDiS diesel and the powerful Boosterjet petrol, power the car and provide a sporty yet fuel-efficient ride. The roomy interior of the cabin is furnished with high-quality materials and cutting-edge technologies, providing comfort and convenience that are unmatched in its class. The Baleno is a remarkable option for contemporary drivers, offering an exciting and sophisticated driving experience thanks to its state-of-the-art infotainment system and cutting-edge safety features.",

    "subdesc": "At Long Drive Cars, experience the best in economical and practical car rental services. Select self-drive rentals to enjoy the independence of chauffeur-driven alternatives while saving money on amazing rates and customer-centric policies. Accept the freedom and privacy that come with driving on your own schedule. The Baleno, with its interior's abundance of features, is designed for long trips. Our self-drive car rentals packages include an unlimited number of kilometers and require no upfront payment, ensuring a leisurely journey at your own speed. Your rental process is now easier with our Self Drive Cars featuring the closest Baleno available for self-driving."
  },

  "toyota glanza": {
    "id": "Toyota Glanza",
    "desc": "The Glanza is an example of how innovation and dependability can coexist when produced by Toyota and Suzuki. Its modern design captivates with its sleek lines and dynamic stance. It has Suzuki's well-known K-series engine under the hood, which offers remarkable performance and fuel economy. Comfort and technology come together inside, where an advanced infotainment system is expertly incorporated into the elegant cabin. Modern features like dual airbags and ABS assure driver peace of mind when driving, emphasizing the importance of safety. Redefining the compact automobile market, the Glanza is a testament to Toyota and Suzuki shared dedication to excellence, providing a seamless fusion of style, performance, and utility.",

    "subdesc": "Long Drive Cars revolutionizes the car rental game with its convenient and budget-friendly service. Opt for self-drive rentals for unmatched affordability and flexibility, setting us apart from chauffeur-driven alternatives. Enjoy the unparalleled freedom and privacy of steering your own adventure. The Glanza, brimming with top-notch features, is your ultimate companion for those long-haul trips. Say goodbye to mileage restrictions and deposits, as our self-drive rentals  offer unlimited kilometers and hassle-free terms. Experience simplified rentals with our Self Drive Cars, offering the nearest self-drive Glanza."
  },

  "nissan magnite": {
    "id": "Magnite",
    "desc": "Magnite Car is a luxury automotive brand that is at the forefront of innovation and elegance. Modern design and precise engineering combine to create a series of Magnite models that combine cutting-edge technology with classic style in a seamless whole. Every feature, from the elegant exterior shapes to the luxurious interior comforts, showcases a dedication to unmatched quality and performance. Magnite, a company with a history steeped in automotive quality, is constantly reinventing the driving experience and raising the bar for elegance and sophistication among a global audience of discriminating fans.",

    "subdesc": "For your car rental needs, Long Drive Cars offers an affordable and practical option. Choose our self-drive car rental option for affordable prices and convenient conditions that outweigh standard chauffeur services. Follow your own schedule to enjoy unrivaled secrecy and liberty. With its cutting-edge interior features, the Magnite model is the best option for long trips. Take advantage of self-drive car rentals with unlimited mileage and no deposit required, guaranteeing a smooth and unimpeded journey at your own speed. Our Self Drive Cars now offer the closest Magnite available, making your rental experience more straightforward."
  },

  "volkswagen vento": {
    "id": "Volkswagen's Vento",
    "desc": "Volkswagen's Vento is the pinnacle of German engineering, combining performance, comfort, and style in just the right amounts. Its elegant exterior design radiates class, and its roomy interior offers plenty of space for travelers. With its cutting-edge safety features and technology, the Vento guarantees a safe and comfortable ride, making every trip delightful. With a selection of powerful engines that come in both gasoline and diesel forms, the Vento achieves remarkable fuel economy without sacrificing performance. The Vento is a vehicle that sets the standard for its class, offering a dynamic and polished driving experience whether cruising on the highway or negotiating city streets.",

    "subdesc": "Set out on an adventure with Long Drive Cars, where our car rental services combine convenience and affordability. Self-drive automobile rental alternatives are more affordable and offer more flexible terms than standard chauffeur-driven ones. Savor the freedom and closeness that come with driving at your own pace. The Vento is the ideal traveling companion because to its wide feature set. With zero deposit and unlimited mileage, our self-drive car rental packages guarantee a smooth journey at your own speed. Discover hassle-free rentals with our Self Drive Cars, which include the nearest available self-drive Vento."
  },

  "volkswagen polo": {
    "id": "Volkswagen's  Polo",
    "desc": "Volkswagen's Polo is a little automobile that combines performance, style, and utility all together. Driving a Polo is pleasant and comfortable thanks to its sophisticated technology features, roomy cabin, and elegant exterior. It has a variety of powerful engines that deliver remarkable fuel economy without sacrificing performance. The Polo's handling agility makes city driving easy, and its safety features provide peace of mind when driving. All things considered, Volkswagen's dedication to quality and innovation in the small car market is embodied by the Polo.",

    "subdesc": "At Long Drive Cars, we've got your back for convenient and pocket-friendly car rentals. Say yes to self-drive car rentals  options for great rates and terms that cater to you, beating out those chauffeur-driven choices any day. Feel the freedom and privacy of steering your own adventure. The Polo, loaded with cool features inside, is your go-to for those long road trips. With our self-drive car rental deals, clock up as many kilometers as you want, zero deposit needed, just smooth sailing at your own rhythm. Our Self Drive Cars now offer the convenience of the closest self-drive Polo available, making your rental experience effortless."
  },

  "ford ecosport": {
    "id": "Ford's EcoSport",
    "desc": "Ford's EcoSport automobile skillfully combines performance-driven design and environmentally sensitive engineering. The sophisticated hybrid engine technology of this vehicle results in an aerodynamic silhouette and lightweight construction that maximize fuel efficiency without sacrificing power. The EcoSport combines sustainability and comfort with its modern, roomy interior and clean exterior. This environmentally friendly marvel not only minimizes environmental damage but also promises an exciting ride, making it an outstanding option for the environmentally conscious driver whether cruising down highways or negotiating urban streets.",

    "subdesc": "Looking for a hassle-free and economical way to rent a car? Look no further than Long Drive Cars! Our self-drive rental service offers unbeatable rates and flexible terms, giving you more bang for your buck compared to chauffeur-driven options. Enjoy the independence and privacy of driving on your own time with our fleet of feature-packed cars like the EcoSport, perfect for those long road trips. Our Self Drive Cars Rentals come with unlimited kilometers and zero deposit required, ensuring a smooth and stress-free journey. Your rental process is now easier with our Self Drive Cars featuring the closest EcoSport available for self-driving."
  },

  "hyundai i20": {
    "id": "Hyundai i20",
    "desc": "The premium hatchback Hyundai i20 from South Korean carmaker Hyundai is a perfect example of how to combine performance, style, and cutting-edge technologies. The i20 is renowned for its svelte styling, which includes a striking front grille, LED illumination, and distinct character lines. It has a roomy, technologically advanced cabin with a touchscreen entertainment system, Android Auto, Apple CarPlay, and several airbags, ABS, and ESC, among other safety features. The i20 guarantees a responsive and effective driving experience and is available with a variety of engine options, including diesel and gasoline. When paired with Hyundai's dependability, its refined ride quality makes it an exceptional option in its class.",

    "subdesc": "Long Drive Cars offers convenient and cost-effective self-drive car rentals. Enjoy budget-friendly rates and customer-friendly terms that surpass chauffeur-driven options. Drive on your own schedule with the feature-packed i20, perfect for long trips. Our self drive car rentals include unlimited kilometers and require zero deposit, ensuring a stress-free journey. Our Self Drive Cars now offer the convenience of the closest self-drive i20 available, making your rental experience effortless."
  },

  "maruthi fronx": {
    "id": "Fronx",
    "desc": "Renowned Japanese carmaker Suzuki produces a small SUV called the Fronx. The Fronx has strong utility along with a sleek, contemporary design, making it ideal for urban living. Its aerodynamic efficiency is increased by its dynamic curves, bright LED headlamps, and strong front grille. The Fronx has a tech-savvy interior with comfy seating, a user-friendly infotainment system, and plenty of cargo space. Its fuel-efficient engine under the hood provides a responsive and comfortable ride, making it a great option for weekend excursions as well as city commuting.",

    "subdesc": "Long Drive Cars offers the greatest rental car experience! We offer cost-effective and practical self-drive car rental solutions with competitive pricing and first-rate customer service. Savor the independence and seclusion of driving at your own pace. With its luxurious cabin, the Fronx is the ideal vehicle for long road journeys. Our self-drive rentals provide an easy and stress-free travel experience with unlimited kilometers and zero deposit needed. Discover hassle-free rentals with our Self Drive Cars, which include the nearest available self-drive Fronx."
  },

  "maruthi s-cross": {
    "id": "Suzuki S-Cross",
    "desc": "Compact crossover SUVs like the Suzuki S-Cross are made for commuting and city driving. It was introduced by the Japanese carmaker Suzuki and combines the rugged stance of an SUV with the agility of a hatchback. Sporty alloy wheels, a powerful front grille, and sleek LED headlamps are all part of its contemporary appearance. The S-Cross's engine lineup is efficient and includes a mild hybrid system for better fuel economy. The inside is roomy and furnished with cutting-edge technology, including an Android Auto, Apple CarPlay, and touchscreen entertainment system. With numerous airbags, ABS, and a number of driver-assist technologies, safety is given top priority, making it a well-rounded option for both families and adventure seekers.",

    "subdesc": "Long Drive Cars makes car rentals easy and affordable. Choose our self-drive car rentals to get the best rates and customer-friendly terms, giving you more value than hiring a chauffeur. Enjoy the freedom and privacy of driving on your own schedule. The S-Cross, packed with great features, is perfect for those long road trips. With our self-drive rentals, you get unlimited kilometers and zero deposit is needed, making your journey stress-free. Enjoy an effortless rental experience with our self-drive cars, including the nearest S-Cross."
  },

  "hyundai venue": {
    "id": "Hyundai Venue",
    "desc": "The Hyundai Venue is a small SUV that has become well-known for its innovative features, elegance, and adaptability. Hyundai, a South Korean carmaker, debuted the Venue, a vehicle aimed at young professionals and city people. Its sleek, contemporary appearance has angular lines, an eye-catching grille, and LED lighting. With an 8-inch touchscreen infotainment system, Apple CarPlay, Android Auto, and a slew of safety features like Hyundai's SmartSense technology, it has a roomy and technologically advanced interior. The Venue is a great vehicle for city travel because of its economical engine options and quick handling, and its attractive price further enhances its attractiveness.",

    "subdesc": "Long Drive Cars provides a cost-effective and convenient car rental service. Opting for self-drive rentals allows customers to enjoy budget-friendly rates and favorable terms, offering greater value compared to chauffeur-driven options. Experience the freedom and privacy of driving according to your own schedule. The Venue, with its well-equipped interior, is perfect for extended road trips. Our self-drive car rentals come with unlimited kilometers and require zero deposit, ensuring a hassle-free journey at your own pace. Experience hassle-free rentals with our self-drive cars, offering the nearest Venue."
  },

  "kia sonet": {
    "id": "Sonet",
    "desc": "In the realm of automobiles, the sonet car is the pinnacle of performance and luxury—a marvel of contemporary engineering. Its streamlined shape, expertly crafted, combines aerodynamic efficiency with elegant aesthetics. It has a strong engine under the hood that provides smooth acceleration and an exhilarating driving experience. It is the ideal fusion of elegance and substance thanks to its cutting-edge safety features and advanced technology, which guarantee convenience and security. The interior offers unparalleled comfort and sophistication, thanks to the use of high-quality materials. Redefining the norms of modern vehicles, the Sonnet brand is the epitome of automotive excellence. It is a monument to ingenuity and painstaking craftsmanship.",

    "subdesc": "Discover the ultimate convenience and savings with Long Drive Cars! Our self-drive car rentals offer unbeatable rates and terms that are more favorable than chauffeur-driven alternatives. Relish the freedom and privacy of setting your own schedule. The Sonnet, loaded with features, is perfect for those long, memorable road trips. Enjoy unlimited kilometers and zero deposit with our self-drive rentals, ensuring a hassle-free adventure at your own pace. Experience simplified rentals with our Self Drive Cars, offering the nearest self-driveSonnet."
  },

  "maruthi ciaz": {
    "id": "Maruti Suzuki Ciaz",
    "desc": "The Maruti Suzuki Ciaz is an elegant sedan that skillfully combines comfort, performance, and style. Its streamlined exterior radiates elegance, while its roomy interior provides the driver and passengers with plush luxury. With cutting-edge technologies like climate control, keyless entry, and touchscreen infotainment, the Ciaz guarantees a fun ride. Because of its fuel-efficient engine, which is perfect for both long trips and city commuting, it gets excellent fuel economy. Given Maruti Suzuki's track record of dependability and affordability, the Ciaz is a strong competitor in the sedan market and provides excellent value.",

    "subdesc": "Long Drive Cars offers convenient and cost-effective self-drive car rentals. Enjoy budget-friendly rates and customer-friendly terms that surpass chauffeur-driven options. Drive on your own schedule with the feature-packed Suzuki Ciaz, perfect for long trips. Our self drive car rentals include unlimited kilometers and require zero deposit, ensuring a stress-free journey. Experience simplified rentals with our Self Drive Cars, offering the nearest self-drive Suzuki Ciaz."
  },

  "skoda rapid": {
    "id": "Skoda Rapid",
    "desc": "Škoda Auto produces the Rapid, a small sedan with a sporty appearance, outstanding performance, and cutting-edge technology. It has a sleek form and athletic lines that make it seem both elegant and sporty. With its powerful engines, it provides a comfortable ride while still achieving remarkable fuel economy. Its roomy inside is furnished with premium components and cutting-edge technology to ensure the comfort and convenience of both the driver and the passengers. The Rapid is a remarkable option in the small sedan class because it combines Škoda's well-known dependability and safety standards with an exhilarating ride, whether traveling on the highway or through urban streets.",

    "subdesc": "We at Long Drive Cars make renting a car simple and reasonably priced. For the greatest deals and most accommodating terms, go for our self-drive car rental option—far more cost-effective than hiring a chauffeur. Savor the liberty of operating a vehicle at any time. For extended travels, The Rapid provides everything you would require. You can travel worry-free with our self-drive car rentals because there are no mileage restrictions and zero deposit requirements. Make your rental experience effortless with our Self Drive Cars, equipped with the nearest self-drive Rapid."
  },

  "tata nexon": {
    "id": "Tata Motors' Nexon ",
    "desc": "Tata Motors' Nexon is a small SUV that is well-known for its sturdy construction, cutting-edge technology, and dependable operation. It provides a pleasant ride for both urban commutes and off-road excursions thanks to its eye-catching appearance and roomy cabins. With its fuel-efficient engines, it guarantees a balance between power and economy. Its state-of-the-art technology, which includes connected car features, touchscreen infotainment, and excellent safety systems, makes it an appealing option in its class. Tata's dedication to innovation and quality in the automotive sector is exemplified by Nexon.",

    "subdesc": "Long Drive Cars offers affordable and practical car rentals. Choose self-drive car rentals over chauffeur-driven options to take advantage of more affordable pricing and customer-focused terms. Enjoy the freedom and privacy of traveling at your own pace. With so many functions, the Nexon is the perfect travel companion for long distance driving. With unlimited kilometers and zero deposit required, our self-drive rentals provide a relaxing trip at your own speed. Make your rental experience effortless with our Self Drive Cars, equipped with the nearest self-drive Nexon."
  },

  "toyota urban cruiser": {
    "id": "Toyota's Urban Cruiser",
    "desc": "Tata Motors' Nexon is a small SUV that is well-known for its sturdy construction, cutting-edge technology, and dependable operation. It provides a pleasant ride for both urban commutes and off-road excursions thanks to its eye-catching appearance and roomy cabins. With its fuel-efficient engines, it guarantees a balance between power and economy. Its state-of-the-art technology, which includes connected car features, touchscreen infotainment, and excellent safety systems, makes it an appealing option in its class. Tata's dedication to innovation and quality in the automotive sector is exemplified by Nexon.",

    "subdesc": "Long Drive Cars provides convenient and cost-effective self-drive car rentals. Enjoy budget-friendly rates and customer-centric terms, superior to chauffeur options. Drive on your own schedule with the feature-packed Urban Cruiser, perfect for long trips. Our self drive car rentals include unlimited kilometers and zero deposit, ensuring a stress-free journey. Discover hassle-free rentals with our Self Drive Cars, which include the nearest available self-drive Urban Cruiser."
  },

  "maruthi breeza": {
    "id": "Maruti Suzuki's Breeza",
    "desc": "Maruti Suzuki's Breeza type is a small SUV that combines design and utility. It radiates confidence with its bold, streamlined look and dominating presence on the road. Its roomy cabin ensures comfort for the driver and passengers by providing enough storage and legroom. The Breeza offers a smooth driving experience because of its modern amenities, which include climate control, airbags, ABS, and touchscreen infotainment. Its fuel-efficient engine under the hood offers a responsive and comfortable ride, making it perfect for long trips as well as city commutes. All things considered, Maruti Suzuki's dedication to customer satisfaction and innovation in the small SUV market is demonstrated by the Breeza.",

    "subdesc": "Long Drive Cars presents a practical and economical car rental solution. Opt for self-drive car rentals for competitive rates and flexible terms, surpassing chauffeur-driven alternatives. Enjoy the autonomy and seclusion of driving according to your own timetable. The Breeza, renowned for its comprehensive interior features, is an ideal choice for extensive journeys. Our self-drive car rentals packages offer unlimited mileage and entail zero deposit, guaranteeing a seamless expedition at your preferred pace. Your rental process is now easier with our Self Drive Cars featuring the closest Breeza available for self-driving."
  },

  "grand vitara": {
    "id": "Vitara",
    "desc": "The Vitara, a compact SUV produced by Suzuki, embodies versatility and style. With its sleek design and robust performance, it seamlessly navigates both urban streets and rugged terrains. Equipped with advanced safety features and cutting-edge technology, the Vitara offers a comfortable and connected driving experience. Its efficient fuel economy and responsive handling make it an ideal choice for modern adventurers seeking both practicality and excitement on the road.",

    "subdesc": "Long Drive Cars offers convenient and cost-effective self-drive car rentals. Enjoy budget-friendly rates and customer-friendly terms that surpass chauffeur-driven options. Drive on your own schedule with the feature-packed Vitara, perfect for long trips. Our self drive car rentals include unlimited kilometers and require zero deposit, ensuring a stress-free journey. Experience simplified rentals with our Self Drive Cars, offering the nearest self-drive Vitara."
  },

  "hyundai creta": {
    "id": "HYUNDAI CRETA",
    "desc": "Creta, manufactured by Hyundai, is a compact SUV known for its stylish design, robust performance, and advanced features. With its sleek exterior, spacious interior, and comfortable seating, the Creta offers both style and practicality. Its powerful engine options provide a smooth driving experience, whether navigating city streets or exploring off-road terrain. Packed with cutting-edge technology, including touchscreen infotainment systems, advanced safety features, and connectivity options, the Creta ensures a modern driving experience. Overall, the Hyundai Creta stands out as a versatile and reliable choice in the competitive SUV market.",

    "subdesc": "Long Drive Cars offers affordable and practical car rentals. Choose self-drive car rentals over chauffeur-driven options to take advantage of more affordable pricing and customer-focused terms. Enjoy the freedom and privacy of traveling at your own pace. With so many functions, the CRETA is the perfect travel companion for long distance driving. With unlimited kilometers and zero deposit required, our self-drive rentals provide a relaxing trip at your own speed. Our Self Drive Cars now offer the convenience of the closest self-drive CRETA available, making your rental experience effortless."
  },

  "mahindra xuv 300": {
    "id": "Mahindra XUV 300",
    "desc": "Mahindra's XUV300 is a small SUV with a combination of performance, safety features, and style. Its confident outward design communicates confidence on the road, and its interior is roomy and pleasant. It guarantees a contemporary driving experience with its advanced technology features, which include a sunroof, touchscreen infotainment, and linked car capabilities. With its strong engine options under the hood, it delivers remarkable performance and fuel efficiency. Features that make every journey safe include dual front airbags, ABS with EBD, and rear parking sensors. Safety is of the utmost importance. Setting new standards in the small SUV market, the XUV300 guarantees an exciting driving experience with its nimble handling and strong build quality.",

    "subdesc": "Looking for a convenient and cost-effective way to rent a car? Long Drive Cars has got you covered! Why not try our self-drive car rental options? They’re budget-friendly and come with great terms that put you first. Say goodbye to chauffeurs and hello to freedom and privacy. The XUV300, with its comfy and feature-rich interior, is just what you need for those long road trips. Plus, with unlimited kilometers and zero deposit, you can hit the road without a worry. And guess what? Your rental process is now easier with our Self Drive Cars featuring the closest XUV300 available for self-driving."
  },

  "kia seltos": {
    "id": "Kia Seltos",
    "desc": "The Kia Seltos is a unique vehicle in the small SUV market that seamlessly blends performance, style, and technology. On the road, its striking exterior design, which is defined by streamlined lines and a dominant attitude, draws attention. Dynamic driving experiences are promised by a variety of potent yet fuel-efficient engine options under the hood, whether traversing city streets or going off-road. The Seltos' interior is contemporary and roomy, with premium materials and easy-to-use technological amenities. These features include a touchscreen entertainment system with smartphone connectivity and cutting-edge safety systems like automated emergency braking and lane-keeping assistance.",

    "subdesc": "Long Drive Cars offers a convenient and cost-effective car rental service. Opt for self-drive car rentals to enjoy budget-friendly rates and customer-friendly terms, providing greater value than chauffeur-driven alternatives. Experience the freedom and privacy of driving on your own schedule. The Kia Seltos , with its feature-packed interior, is ideal for extended road trips. Our self-drive rentals feature unlimited kilometers with zero deposit required, ensuring a stress-free journey at your own pace. Make your rental experience effortless with our Self Drive Cars, equipped with the nearest self-drive Kia Seltos."
  },

  "hyundai verna": {
    "id": "Verna",
    "desc": "One of Hyundai's best-ever designs, the Verna, is a sedan par excellence in terms of performance and sophistication. It is elegant with its streamlined exterior and tasteful interior. Its powerful engine provides a good mix of efficiency and power under the hood. Modern technology and cutting-edge safety measures combine to provide a driving experience in the Verna that skillfully blends comfort and innovation. It's evidence of Hyundai's dedication to designing cars that satisfy functionality and aesthetics, which makes it an appealing option in the cutthroat sedan segment.",

    "subdesc": "Discover the perfect blend of convenience and affordability with Long Drive Cars! Our self-drive car rental options are designed to offer you budget-friendly rates and customer-friendly terms, giving you more value than chauffeur-driven services. Relish the freedom and privacy of driving on your own schedule. The Verna, featuring a luxurious interior, is your ideal companion for extended road trips. Enjoy our self drive car rentals  unlimited kilometers and zero deposit requirements, ensuring a stress-free journey at your own pace. Discover hassle-free rentals with our Self Drive Cars, which include the nearest available self-drive Verna."
  },

  "mg hector": {
    "id": "MG Hector",
    "desc": "The MG Hector is a contemporary marvel that personifies performance and sophistication. It was created by the well-known British automaker MG (Morris Garages), and it skillfully combines state-of-the-art technology with sophisticated style. Everything about the Hector is elegant, from the exterior's sleek design to the interior's ample space and opulence. It provides luxury and peace of mind on every trip thanks to its cutting-edge features, which include a panoramic sunroof, a sizable infotainment system with networking choices, and sophisticated safety features. Driven with dynamic style and environmental friendliness, it is propelled by a variety of economical gasoline and hybrid engines. The MG Hector is a car that exudes style and substance like no other, making it a true symbol of automotive perfection on the road.",

    "subdesc": "With Long Drive Cars, find the ideal balance between budget and convenience. We've crafted our self-drive car rental choices with affordable prices and flexible terms in mind, providing you with greater value than chauffeured services. Savor the autonomy and seclusion of driving at your own pace. With its plush cabin, the MG Hector is the perfect travel partner for long-distance drives. Take advantage of unlimited mileage and no deposit requirements for self-drive car rentals, which provide a stress-free trip at your own speed. Our Self Drive Cars now offer the convenience of the closest self-drive MG Hector available, making your rental experience effortless."
  },

  "mahindra thar": {
    "id": "Mahindra Thar",
    "desc": "The Mahindra-reimagined icon, the all-new Thar, epitomizes the spirit of adventure and roughness. Its sturdy construction, which includes recognizable square wheel arches and a powerful stance, screams off-road competence. Beneath, a strong chassis and cutting-edge 4x4 technology offer unmatched performance on any kind of terrain. Inside, contemporary amenities perfectly complement a practical design to provide a first-rate driving experience. The Thar is the pinnacle of adventure on wheels because it offers thrilling driving experiences and improved safety features on every trip.",

    "subdesc": "Long Drive Cars provides an economical and practical vehicle rental service. Self-drive car rentals provide better value than chauffeur-driven options, with more affordable pricing and flexible terms to suit your needs. Enjoy the solitude and independence of driving when you choose. Long road journeys are perfect for the Thar because of its interior's abundance of features. With our self-drive car rentals, you can travel stress-free and at your own speed for an unlimited number of kilometers with zero deposit needed. Your rental process is now easier with our Self Drive Cars featuring the closest Thar available for self-driving."
  },

  "i20 sunroof": {
    "id": "i20 Sunroof",
    "desc": "The Hyundai i20 Sunroof variant's svelte styling and cutting-edge technology provide an enhanced driving experience. It lets natural light into the cabin through its panoramic sunroof, giving occupants a feeling of space and airiness. Reputable for its dependability and fuel efficiency, this small automobile skillfully blends design and utility. With its cutting-edge technologies and cozy cabin, the i20 Sunroof guarantees comfort and convenience whether driving on road trips or through metropolitan streets. This vehicle, which is built by Hyundai, a reliable brand known for reliability and performance, guarantees an enjoyable driving experience every time.",

    "subdesc": "With Long Drive Cars, find the ideal fusion of cost and convenience. We've crafted our self-drive vehicle rental choices with affordable prices and flexible terms in mind, providing you with greater value than chauffeured services. Savor the autonomy and seclusion of driving at your own pace. With its opulent cabin, the i20 Sunroof is the perfect travel partner for long distance drives. Take advantage of unlimited mileage and zero deposit requirements for self-drive car rentals, which provide a stress-free trip at your own speed. Discover hassle-free rentals with our Self Drive Cars, which include the nearest available self-drive i20 Sunroof."
  },

  "ecosport sunroof": {
    "id": "Ecosports sunroof",
    "desc": "The EcoSport, a compact SUV by Ford, boasts a sleek design coupled with a panoramic sunroof, offering a heightened driving experience. Its sunroof floods the cabin with natural light, enhancing the spacious interior ambiance. Designed for both urban commutes and off-road adventures, the EcoSport blends versatility with style, featuring advanced technology and safety features. This car is a perfect blend of practicality and luxury, making every journey a delight.",

    "subdesc": "Looking for a convenient and cost-effective way to rent a car? Long Drive Cars has got you covered! Why not try our self-drive car rentals options? They’re budget-friendly and come with great terms that put you first. Say goodbye to chauffeurs and hello to freedom and privacy. The Bolt, with its comfy and feature-rich interior, is just what you need for those long road trips. Plus, self drive car rentals with unlimited kilometers and zero deposit, you can hit the road without a worry. And guess what? Make your rental experience effortless with our Self Drive Cars, equipped with the nearest self-drive i20 Sunroof."
  },

  "exter sunroof": {
    "id": "Exter Sunroof ",
    "desc": "The Exter Sunroof Car, a sleek and innovative vehicle crafted by a leading luxury brand, embodies a harmonious blend of cutting-edge technology and elegant design. Its panoramic sunroof spans the entire length of the car's roof, offering occupants an immersive experience with stunning views of the sky above. Crafted with premium materials and meticulous attention to detail, every aspect of the Exter exudes sophistication and refinement. Whether cruising through urban streets or embarking on scenic drives, this car promises a journey defined by comfort, style, and an unparalleled connection to the world outside.",

    "subdesc": "Long Drive Cars is your go-to destination for convenient and budget-friendly car rentals. With our self-drive car rentals, you're in control of your journey from start to finish. Enjoy the freedom and privacy of driving yourself without the hassle of chauffeurs. The Exter Sunroof offers a comfortable and feature-rich interior, ideal for those extended road trips. And self drive car rentals with unlimited kilometers and zero deposit necessary, there are no limits to your adventure. Discover hassle-free rentals with our Self Drive Cars, which include the nearest available self-drive Exter Sunroof."
  },

  "venue sunroof": {
    "id": "Venue Sunroof",
    "desc": "The Hyundai Venue Sunroof is a small SUV that has become well-known for its innovative features, elegance, and adaptability. Hyundai, a South Korean carmaker, debuted the Venue, a vehicle aimed at young professionals and city people. Its sleek, contemporary appearance has angular lines, an eye-catching grille, and LED lighting. With an 8-inch touchscreen infotainment system, Apple CarPlay, Android Auto, and a slew of safety features like Hyundai's SmartSense technology, it has a roomy and technologically advanced interior. The Venue is a great vehicle for city travel because of its economical engine options and quick handling, and its attractive price further enhances its attractiveness.",

    "subdesc": "Long Drive Cars provides a cost-effective and convenient car rental service. Opting for self-drive rentals allows customers to enjoy budget-friendly rates and favorable terms, offering greater value compared to chauffeur-driven options. Experience the freedom and privacy of driving according to your own schedule. The Venue Sunroof, with its well-equipped interior, is perfect for extended road trips. Our self-drive car rentals come with unlimited kilometers and require zero deposit, ensuring a hassle-free journey at your own pace. Your rental process is now easier with our Self Drive Cars featuring the closest Venue Sunroof available for self-driving."
  },

  "breeza sunroof": {
    "id": "Breeza Sunroof",
    "desc": "Maruti Suzuki's Breeza Sunroof  type is a small SUV that combines design and utility. It radiates confidence with its bold, streamlined look and dominating presence on the road. Its roomy cabin ensures comfort for the driver and passengers by providing enough storage and legroom. The Breeza offers a smooth driving experience because of its modern amenities, which include climate control, airbags, ABS, and touchscreen infotainment. Its fuel-efficient engine under the hood offers a responsive and comfortable ride, making it perfect for long trips as well as city commutes. All things considered, Maruti Suzuki's dedication to customer satisfaction and innovation in the small SUV market is demonstrated by the Breeza.",

    "subdesc": "Long Drive Cars presents a practical and economical car rental solution. Opt for self-drive car rentals for competitive rates and flexible terms, surpassing chauffeur-driven alternatives. Enjoy the autonomy and seclusion of driving according to your own timetable. The Breeza Sunroof , renowned for its comprehensive interior features, is an ideal choice for extensive journeys. Our self-drive car rentals packages offer unlimited mileage and entail zero deposit, guaranteeing a seamless expedition at your preferred pace. Discover hassle-free rentals with our Self Drive Cars, which include the nearest available self-drive Breeza Sunroof."
  },

  "sonet sunroof imt": {
    "id": "Sonet Sunroof",
    "desc": "In the realm of automobiles, the Sonet Sunroof car is the pinnacle of performance and luxury—a marvel of contemporary engineering. Its streamlined shape, expertly crafted, combines aerodynamic efficiency with elegant aesthetics. It has a strong engine under the hood that provides smooth acceleration and an exhilarating driving experience. It is the ideal fusion of elegance and substance thanks to its cutting-edge safety features and advanced technology, which guarantee convenience and security. The interior offers unparalleled comfort and sophistication, thanks to the use of high-quality materials. Redefining the norms of modern vehicles, the Sonet brand is the epitome of automotive excellence. It is a monument to ingenuity and painstaking craftsmanship.",

    "subdesc": "Discover the ultimate convenience and savings with Long Drive Cars! Our self-drive car rentals offer unbeatable rates and terms that are more favorable than chauffeur-driven alternatives. Relish the freedom and privacy of setting your own schedule. The Sonnet Sunroof, loaded with features, is perfect for those long, memorable road trips. Enjoy unlimited kilometers and zero deposit with our self-drive rentals, ensuring a hassle-free adventure at your own pace. Our Self Drive Cars now offer the convenience of the closest self-drive Sonnet Sunroof available, making your rental experience effortless."
  },

  "tata nexon sunroof": {
    "id": "Nexon Sunroof",
    "desc": "Tata Motors' Nexon Sunroof  is a small SUV that is well-known for its sturdy construction, cutting-edge technology, and dependable operation. It provides a pleasant ride for both urban commutes and off-road excursions thanks to its eye-catching appearance and roomy cabins. With its fuel-efficient engines, it guarantees a balance between power and economy. Its state-of-the-art technology, which includes connected car features, touchscreen infotainment, and excellent safety systems, makes it an appealing option in its class. Tata's dedication to innovation and quality in the automotive sector is exemplified by Nexon.",

    "subdesc": "Long Drive Cars offers affordable and practical car rentals. Choose self-drive car rentals over chauffeur-driven options to take advantage of more affordable pricing and customer-focused terms. Enjoy the freedom and privacy of traveling at your own pace. With so many functions, the Nexon Sunroof  is the perfect travel companion for long distance driving. With unlimited kilometers and zero deposit required, our self-drive rentals provide a relaxing trip at your own speed. Your rental process is now easier with our Self Drive Cars featuring the closest Nexon Sunroof available for self-driving."
  },

  "verna sunroof": {
    "id": "Verna Sunroof",
    "desc": "One of Hyundai's best-ever designs, the Verna Sunroof  , is a sedan par excellence in terms of performance and sophistication. It is elegant with its streamlined exterior and tasteful interior. Its powerful engine provides a good mix of efficiency and power under the hood. Modern technology and cutting-edge safety measures combine to provide a driving experience in the Verna Sunroof   that skillfully blends comfort and innovation. It's evidence of Hyundai's dedication to designing cars that satisfy functionality and aesthetics, which makes it an appealing option in the cutthroat sedan segment.",

    "subdesc": "Discover the perfect blend of convenience and affordability with Long Drive Cars! Our self-drive car rental options are designed to offer you budget-friendly rates and customer-friendly terms, giving you more value than chauffeur-driven services. Relish the freedom and privacy of driving on your own schedule. The Verna Sunroof, featuring a luxurious interior, is your ideal companion for extended road trips. Enjoy our self drive car rentals  unlimited kilometers and zero deposit requirements, ensuring a stress-free journey at your own pace. Make your rental experience effortless with our Self Drive Cars, equipped with the nearest self-drive Verna Sunroof."
  },

  "creta sunroof": {
    "id": "CRETA Sunroo",
    "desc": "CRETA Sunroof  , manufactured by Hyundai, is a compact SUV known for its stylish design, robust performance, and advanced features. With its sleek exterior, spacious interior, and comfortable seating, the CRETA Sunroof   offers both style and practicality. Its powerful engine options provide a smooth driving experience, whether navigating city streets or exploring off-road terrain. Packed with cutting-edge technology, including touchscreen infotainment systems, advanced safety features, and connectivity options, the CRETA Sunroof  ensures a modern driving experience. Overall, the Hyundai Creta stands out as a versatile and reliable choice in the competitive SUV market.",

    "subdesc": "Long Drive Cars offers affordable and practical car rentals. Choose self-drive car rentals over chauffeur-driven options to take advantage of more affordable pricing and customer-focused terms. Enjoy the freedom and privacy of traveling at your own pace. With so many functions, the CRETA Sunroof   is the perfect travel companion for long distance driving. With unlimited kilometers and zero deposit required, our self-drive rentals provide a relaxing trip at your own speed. Experience simplified rentals with our Self Drive Cars, offering the nearest self-drive CRETA Sunroof."
  },

  "astor sunroof": {
    "id": "Astor Sunroof",
    "desc": "The Astor Sunroof car offers an exceptional blend of style, comfort, and innovation. With its panoramic sunroof, passengers can enjoy an open-air experience, enhancing the sense of spaciousness and connection to the surroundings. This feature floods the cabin with natural light, creating a bright and inviting atmosphere. The sleek design is complemented by advanced technology, including a user-friendly infotainment system and cutting-edge safety features. Under the hood, the Astor delivers a smooth and powerful performance, making it an ideal choice for those seeking both luxury and practicality in their driving experience.",

    "subdesc": "Long Drive Cars is your go-to destination for convenient and budget-friendly car rentals! With our self-drive options, you're in control of your journey from start to finish. Enjoy the freedom and privacy of driving yourself without the hassle of chauffeurs. The Astor Sunroof  offers a comfortable and feature-rich interior, ideal for those extended road trips. And self drive car rentals  with unlimited kilometers and zero deposit necessary, there are no limits to your adventure. Experience simplified rentals with our Self Drive Cars, offering the nearest self-drive Astor Sunroof."
  },

  "seltos sunroof": {
    "id": "  Seltos Sunroof",
    "desc": "The Seltos Sunroof  is a unique vehicle in the small SUV market that seamlessly blends performance, style, and technology. On the road, its striking exterior design, which is defined by streamlined lines and a dominant attitude, draws attention. Dynamic driving experiences are promised by a variety of potent yet fuel-efficient engine options under the hood, whether traversing city streets or going off-road. The Seltos Sunroof ' interior is contemporary and roomy, with premium materials and easy-to-use technological amenities. These features include a touchscreen entertainment system with smartphone connectivity and cutting-edge safety systems like automated emergency braking and lane-keeping assistance.",

    "subdesc": "Long Drive Cars offers a convenient and cost-effective car rental service. Opt for self-drive car rentals to enjoy budget-friendly rates and customer-friendly terms, providing greater value than chauffeur-driven alternatives. Experience the freedom and privacy of driving on your own schedule. The Kia Seltos Sunroof  , with its feature-packed interior, is ideal for extended road trips. Our self-drive rentals feature unlimited kilometers with zero deposit required, ensuring a stress-free journey at your own pace. Make your rental experience effortless with our Self Drive Cars, equipped with the nearest self-drive Kia Seltos Sunroof."
  },

  "mg hector plus sunroof": {
    "id": "MG Hector Sunroof",
    "desc": "The MG Hector Sunroof  is a contemporary marvel that personifies performance and sophistication. It was created by the well-known British automaker MG (Morris Garages), and it skillfully combines state-of-the-art technology with sophisticated style. Everything about the Hector is elegant, from the exterior's sleek design to the interior's ample space and opulence. It provides luxury and peace of mind on every trip thanks to its cutting-edge features, which include a panoramic sunroof, a sizable infotainment system with networking choices, and sophisticated safety features. Driven with dynamic style and environmental friendliness, it is propelled by a variety of economical gasoline and hybrid engines. The MG Hector is a car that exudes style and substance like no other, making it a true symbol of automotive perfection on the road.",

    "subdesc": "Long Drive Cars offers the perfect blend of budget and convenience through our self-drive car rental services. Designed to be affordable and flexible, our car rentals provide better value than chauffeured options. Relish the freedom and privacy of self-drive cars, equipped with luxurious cabins ideal for long journeys. Take advantage of unlimited mileage and zero deposit requirements, ensuring a stress-free experience. Discover hassle-free rentals with our Self Drive Cars, which include the nearest available self-drive MG Hector Sunroof."
  },

  "renault tribber": {
    "id": "Triber",
    "desc": "The Renault Triber is a practical and small MPV that can fit up to seven people. With a 1.0-liter gasoline engine, it provides the perfect balance of performance and economy, making it appropriate for both long trips and city driving. Because of its adjustable seating arrangement, the Triber can be configured in a variety of ways. For example, the third row can be removed to increase cargo capacity. Its strong design gives it a sporty yet practical appeal with its streamlined front grille, LED DRLs, and noticeable roof rails. Its interior features a cutting-edge dashboard with an 8-inch touchscreen entertainment system, as well as clever connectivity choices and lots of storage capacity. With dual airbags, ABS with EBD, and rear parking sensors, safety is given first priority. All things considered, the Renault Triber is unique as an affordable, adaptable, and family-friendly vehicle in its segment.",

    "subdesc": "Long Drive Cars offers the perfect blend of budget and convenience through our self-drive car rental services. Designed to be affordable and flexible, our car rentals provide better value than chauffeured options. Relish the freedom and privacy of self-drive cars, equipped with luxurious cabins ideal for long journeys. Our self drive Car rentals take advantage of unlimited mileage and zero deposit requirements, ensuring a stress-free experience.Discover hassle-free rentals with our Self Drive Cars, which include the nearest available self-drive Triber."
  },

  "mahindra bolero": {
    "id": "Mahindra Bolero",
    "desc": "The Mahindra Bolero Neo is a powerful SUV that combines contemporary elegance with classic toughness. Its potent 1.5-liter mHawk diesel engine, which produces 100 horsepower and 260 Nm of torque, guarantees excellent performance and economy. The SUV has a modern look that doesn't compromise on the classic ruggedness of the Bolero, which is highlighted by the powerful body lines, sharp headlamps, and bold front grille. The Neo's interior features a cozy seven-seater saloon with first-rate leather and a cutting-edge multimedia system. With dual airbags, ABS, EBD, and high ground clearance, among other safety features, it's designed for both off-road and urban adventures.",

    "subdesc": "Long Drive Cars provides self-drive car rental services that are the ideal balance between affordability and convenience. Our flexible and reasonably priced car rentals offer a more economical option than cabs. Savor the independence and seclusion of self-drive cars, which come with opulent interiors perfect for extended travels. With our self-drive car rentals, you can enjoy stress-free travel with unlimited mileage and zero deposit needed. Our Self Drive Cars now offer the convenience of the closest self-drive Bolero Neo available, making your rental experience effortless."
  },

  "mahindra tuv 300": {
    "id": "Mahindra TUV300",
    "desc": "Designed for both off-road and urban driving, the Mahindra TUV300 is a tough, little SUV. It has a strong, military-inspired design, a bold front grille, and considerable ground clearance. The TUV300 is propelled by a 1.5-liter mHawk100 diesel engine, which provides a good mix of power and fuel economy. The roomy inside has contemporary electronics options, a well-organized dashboard, and cozy seating for seven people. Dual airbags, ABS with EBD, and a sturdy body structure all put safety first. It embodies Mahindra's heritage of performance and endurance because to its sturdy construction and rear-wheel drive setup, which makes it capable of managing a variety of terrains.",

    "subdesc": "Find the ideal combination of cost and convenience with Long Drive Cars. When compared to taxi services, our self-drive car rentals offer better value because they are more flexible and affordable. Driving at your own speed allows you to enjoy privacy and freedom. Our luxuriously equipped self-drive cars are the perfect traveling partners for extended trips. All-you-can-self drive cars come with zero deposit options and unlimited mileage. Your rental process is now easier with our Self Drive Cars featuring the closest TUV300 available for self-driving."
  },

  "maruthi ertiga": {
    "id": "Suzuki Ertiga",
    "desc": "Designed to meet the demands of families and large groups, the Maruti Suzuki Ertiga is a multipurpose and capacious MPV. Fuel economy and performance are combined in this vehicle, which is powered by effective gasoline and diesel engine options. A strong front grille, fashionable headlights, and modern body lines give the Ertiga a sleek, aerodynamic appearance. There's plenty of legroom, adjustable seating for up to seven passengers, and contemporary infotainment systems inside its luxurious cabin. The reinforced body construction, dual airbags, and ABS with EBD all prioritize safety. The Ertiga is a well-liked option in its class thanks to its comfortable ride, agile handling, and affordable price.",

    "subdesc": "With Long Drive Cars, discover the perfect balance between budget and convenience. Our self-drive car rentals are designed with affordability and flexibility in mind, offering superior value compared to cab and other services. Enjoy the freedom and privacy of driving at your own pace. Our self-drive cars boast plush interiors, making them the ideal travel companions for long-distance journeys. Benefits  from car rentals are unlimited mileage and zero deposit requirements, ensuring a stress-free trip tailored to your speed. Make your rental experience effortless with our Self Drive Cars, equipped with the nearest self-drive Ertiga."
  },

  "maruthi xl6": {
    "id": "Maruti Suzuki's XL6",
    "desc": "Maruti Suzuki's XL6 is a high-end MPV that is positioned as an opulent version of the well-liked Ertiga. With its aggressive front grille, quad-LED headlights, and roof rails, it has an eye-catching style that makes it look like a sporty SUV. The XL6's interior is luxurious and roomy, with leatherette upholstery, second-row captain seats, and lots of legroom. It has contemporary amenities like cruise control, automated climate control, and a SmartPlay Studio touchscreen infotainment system. Driven by a 1.5-liter K15B petrol engine with mild hybrid technology, it has a 5-speed manual or 4-speed automatic transmission and guarantees a smooth and economical ride. The XL6 is an attractive option because to its enhanced safety features, which include dual airbags, ABS with EBD, and rear parking sensors.",

    "subdesc": "Long Drive Cars offers the perfect blend of budget and convenience through our self-drive car rental services. Designed to be affordable and flexible, our rentals provide better value than cab options. Relish the freedom and privacy of self-drive cars, equipped with luxurious cabins ideal for long journeys. Our self drive car rentals take advantage of unlimited mileage and zero deposit requirements, ensuring a stress-free experience.Discover hassle-free rentals with our Self Drive Cars, which include the nearest available self-drive  XL6"
  },

  "kia carens": {
    "id": "Carens",
    "desc": "The Carens Car is the epitome of elegance and functionality. Its elegant exterior design skillfully combines powerful features with aerodynamic curves. Modern multimedia systems and plush upholstery fill the roomy interior, guaranteeing passengers' comfort and connectedness during every trip. Under the hood, a strong but fuel-efficient engine produces responsive performance that makes commuting in the city as easy as traveling long distances. With cutting-edge driver-assistance systems and a strong, protective chassis, safety is still the first priority. With plenty of cargo space and adjustable seating arrangements to accommodate a range of needs, the Carens Car is a highly versatile vehicle that is perfect for both families and adventurers who want dependability and style in every mile.",

    "subdesc": "Find the ideal balance between cost and convenience with Long Drive Cars. Our self-drive car rentals provide better value than taxi services since we are more affordable and flexible. Experience the independence and seclusion of driving at your own speed. Our self-drive cars have luxurious interiors that make them the perfect traveling companions for extended trips. Unlimited mileage and no deposit requirements are advantages of self-drive cars, guaranteeing a stress-free journey that is customized to your speed. Our Self Drive Cars now offer the convenience of the closest self-drive Carens available, making your rental experience effortless."
  },

  "mahindra xuv 500": {
    "id": "Mahindra XUV500",
    "desc": "Renowned for its strong build and outstanding capabilities, the Mahindra XUV500 is a powerful SUV. It has a commanding presence on the road because of its powerful stance and aerodynamic proportions. It guarantees an exciting driving experience both on and off the main road thanks to its powerful engine and cutting-edge AWD capabilities. With high-end materials and state-of-the-art features like a touchscreen entertainment system, climate control, and enough seating for seven, the interior exudes elegance while being functional. With several airbags, electronic stability control, and ABS, safety is of the first importance. One of the best SUVs available is the XUV500, which offers the ideal mix of comfort and excitement.",

    "subdesc": "With Long Drive Cars, find the ideal ratio between price and convenience. In comparison to taxi services, our self-drive car rentals are more valuable because they are made to give you flexible terms and reasonable pricing. Experience the liberty and seclusion of traveling at your own speed in our luxurious and cozy cabins—perfect for extended travels. Our self-drive vehicles guarantee a stress-free, customized travel experience with unlimited mileage and zero deposit needs. For a flawless self-drive car rental experience, go with Long Drive Cars."
  },

  "hycross": {
    "id": "Hycross",
    "desc": "The Hycross cars features a sleek, aerodynamic body that improves efficiency and combines state-of-the-art technology with environmentally sensitive design. Its cutting-edge hybrid engine offers remarkable performance along with environmental advantages by smoothly combining gasoline and electric power. Inside, the cabin's high-end materials and cutting-edge connection technologies radiate sophistication. The Hycross places a high priority on safety thanks to its strong structural engineering and array of sophisticated driver-assist technologies. With its promise of a premium driving experience without sacrificing environmental responsibility, this vehicle redefines sustainability in the automobile industry.",

    "subdesc": "Find the ideal combination of affordability and convenience with Long Drive Cars. When compared to taxi services, our self-drive car rentals offer better value because they are more affordable and flexible. Enjoy traveling at your own speed and having privacy. With their luxurious interiors, our self-drive cars are the perfect travel companions for extended trips. Self-drive automobile rentals include zero down payment and unlimited mileage, making for a stress-free journey that can be customized to your speed. Our Self Drive Cars now offer the convenience of the closest self-drive Hycross available, making your rental experience effortless."
  },

  "innova crysta": {
    "id": "Crysta",
    "desc": "The Crysta Car embodies sleek elegance and futuristic innovation. Its aerodynamic silhouette seamlessly integrates with LED accent lighting that traces its contours, illuminating the road ahead with a blend of style and functionality. The interior is a sanctuary of luxury, featuring premium leather upholstery and state-of-the-art technology at every touchpoint. With advanced driver-assist systems and a responsive hybrid engine, the Crysta Car delivers both exhilarating performance and eco-conscious efficiency. Whether navigating urban streets or embarking on a cross-country adventure, this car redefines the driving experience with its blend of sophistication and cutting-edge design.",

    "subdesc": "Long Drive Cars offers the perfect blend of budget and convenience through our self-drive car rental services. Designed to be affordable and flexible, our rentals provide better value than chauffeured options. Relish the freedom and privacy of self-drive cars, equipped with luxurious cabins ideal for long journeys.Self drive car rentals take advantage of unlimited mileage and zero deposit requirements, ensuring a stress-free experience. Our Self Drive Cars now offer the convenience of the closest self-drive Crysta available, making your rental experience effortless."
  },

  "toyota fortuner": {
    "id": "Fortuner",
    "desc": "Presenting the revolutionary Fortuner—a revolutionary combination of strength and elegance. With a dramatic LED headlight integration and a powerful front grille that exudes modern refinement, its aerodynamic, sleek form is sure to turn heads. Beneath its elegant look is a strong range of engines that provide outstanding efficiency and performance to suit the demands of any driver. On the inside, the Fortuner has an opulent cabin with high-end materials and cutting-edge technology, such as an entertainment system that is state-of-the-art and sophisticated driver assistance functions that provide unmatched comfort and safety. The Fortuner redefines automotive perfection by combining innovation and versatility to deliver an amazing driving experience, whether cruising through urban streets or venturing into tough terrain.",

    "subdesc": "With Long Drive Cars, find the ideal ratio between price and convenience. Our self-drive car rentals are more valuable than taxi services because they are made to give you flexible terms and reasonable costs. Experience the liberty and seclusion of traveling at your own speed in our luxurious and cozy cabins—perfect for extended travels. Our self-drive cars guarantee a stress-free travel experience catered to your speed, with unlimited mileage rentals and zero deposit requirements. For a flawless self-drive car rental experience, go with Long Drive Cars."
  },

  "hyundai alcazar": {
    "id": "Alcazar",
    "desc": "A wonder of automotive design, the Alcazar combines powerful functionality with svelte styling. Its aerodynamic shape has flowing, graceful lines that exude modernity and elegance. Modern technology combined with an opulent interior filled with high-quality materials and cutting-edge infotainment systems makes the Alcazar an exceptional vehicle in terms of comfort and connectivity. Its strong engine under the hood produces remarkable efficiency and performance, making every drive a pleasure. This crossover SUV redefines adaptability with its generous passenger and baggage space, making it equally suitable for both urban commutes and adventurous travels. The Alcazar epitomizes automotive perfection, seamlessly fusing flair, ingenuity, and functionality.",

    "subdesc": "With Long Drive Cars, discover the perfect balance between budget and convenience. Our self-drive car rentals are designed with affordability and flexibility in mind, offering superior value compared to chauffeured services. Enjoy the freedom and privacy of driving at your own pace. Our self-drive cars boast plush interiors, making them the ideal travel companions for long-distance journeys. Benefit from unlimited mileage and no deposit requirements, ensuring a stress-free trip tailored to your speed. Your rental process is now easier with our Self Drive Cars featuring the closest Alcazar  available for self-driving."
  },

  "mahindra xuv 500 sunroof": {
    "id": " XUV500 W1",
    "desc": "A high-end car that expertly combines performance and luxury is the XUV500 W1. It has a confident-looking, strong front grille and a clean, aerodynamic design with smooth lines. A touch of openness is provided by the sunroof, which lets natural light fill the roomy, finely designed interior. It has a strong engine under the hood that provides strong performance and a comfortable ride. All throughout, cutting-edge technology is included, including an entertainment system of the highest caliber and innovative safety measures. Sophisticated drivers looking for comfort, dynamic capability, and sophistication all in one classy package will get what they're looking for in the XUV500 W1.",

    "subdesc": "Long Drive Cars offers the perfect blend of budget and convenience through our self-drive car rental services. Designed to be affordable and flexible, our rentals provide better value than chauffeured options. Relish the freedom and privacy of self-drive cars, equipped with luxurious cabins ideal for long journeys. Self drive car rentals take advantage of unlimited mileage and zero deposit requirements, ensuring a stress-free experience. Our Self Drive Cars now offer the convenience of the closest self-drive XUV500 W1 available, making your rental experience effortless."
  },

  "xuv 700": {
    "id": "XUV700",
    "desc": "The XUV700 is a state-of-the-art SUV that personifies elegance and contemporary automotive engineering. Its aerodynamic contours and unique LED illumination accentuate its sturdy yet elegant appearance. Premium materials, cutting-edge entertainment systems, and a host of comfort amenities including heated seats, climate control, and a panoramic sunroof decorate the roomy cabin. The XUV700 has a strong engine that produces great performance and fuel economy. It also has an advanced all-wheel-drive system that enhances handling. Maximum protection is ensured by cutting-edge safety systems like lane-keeping assistance, adaptive cruise control, and a robust airbag system. This car stands out in the SUV market because it skillfully blends elegance and modernity.",

    "subdesc": "Long Drive cars can help you find the ideal ratio between price and convenience. When compared to taxi services, our self-drive car rentals give you better value due to their flexible terms and reasonable costs. With our luxurious, cozy cabins—perfect for long-distance travels—enjoy the independence and seclusion of traveling at your own speed. Our self-drive automobiles guarantee a stress-free travel experience catered to your speed, with unlimited mileage and zero deposit requirements. If you want your self-drive car rental to go smoothly, go with Long Drive Cars."
  },

  "mg hector plus": {
    "id": " Hector Plus",
    "desc": "In the mid-size SUV market, the Hector Plus with a sunroof is the pinnacle of elegance and grace. Its aggressive exterior design includes LED headlamps that blend in perfectly with its bulky posture, a chrome-studded grille, and powerful lines. Driving is made more enjoyable by the panoramic sunroof, which lets natural light stream into the roomy cabin that is furnished with plush leather seats and mood lighting. With cutting-edge gasoline and diesel engines and a choice of a seamless automatic or manual gearbox, the Hector Plus's engine compartment delivers strong performance. With a 10.4-inch touchscreen, connected car features, and a number of safety systems, this state-of-the-art vehicle offers comfort, connectivity, and peace of mind on every trip.",

    "subdesc": "With Long Drive Cars, discover the perfect balance between budget and convenience. Our self-drive car rentals are designed with affordability and flexibility in mind, offering superior value compared to cab services. Enjoy the freedom and privacy of driving at your own pace. Our self-drive cars boast plush interiors, making them the ideal travel companions for long-distance journeys. Benefits from self drive car rentals unlimited mileage and no deposit requirements, ensuring a stress-free trip tailored to your speed. Plus, with the added convenience of doorstep delivery, your car rental experience has never been simpler."
  },

  "xuv 700 ax7": {
    "id": "XUV700 Ax7",
    "desc": "The XUV700 Ax7 is a sleek, contemporary SUV that blends elegant styling with powerful performance. It has an 8-speed automated transmission and a 2.0-liter turbocharged engine that produces 200 horsepower and 250 lb-ft of torque for rapid, seamless driving. Its exterior exudes a sporty yet stylish appeal with its crisp lines, LED headlights, and 20-inch alloy wheels. The cabin is roomy and opulent inside, with high-end leather seating, a panoramic sunroof, and cutting-edge technology like adaptive cruise control, a 12-inch touchscreen infotainment system, and a full complement of safety features including automated emergency braking and lane-keeping assistance.",

    "subdesc": "Long Drive Cars provides self-drive car rental services that are the ideal balance between affordability and convenience. Our self drive car rentals offer more value than taxi options because they are made to be versatile and reasonably priced. Savor the independence and seclusion of self-drive vehicles, which come with opulent interiors perfect for extended travels. Self drive car rentals take advantage of unlimited mileage and zero deposit requirements, ensuring a stress-free experience. Your rental process is now easier with our Self Drive Cars featuring the closest XUV700 Ax7 available for self-driving."
  }
}
